---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.HotWaterLoopId
source: html/0cb8dad3-1241-af85-78e6-9ec277a30944.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.HotWaterLoopId Property

The water loop element id for the hot-water heating coil.

## Syntax (C#)
```csharp
public ElementId HotWaterLoopId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null